"use client";

export default function tos() {
    return (
        <div className="flex fixed w-screen h-screen inset-0 bg-white z-50 justify-center overflow-auto">
            <div className="flex flex-col text-center mt-20 mx-10 w-250 text-left">
                <h1 className="text-5xl mb-10 font-bold">利用規約</h1>
                <p>この利用規約（以下，「本規約」といいます。）は，Kotatsu（以下，「当方」といいます。）がこのウェブサイト上で提供するサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。本サービスを利用することによって、ユーザーは本規約に同意したものとなります。</p>
                <h2 className="text-2xl font-bold my-5">第1条（適用）</h2>
                <p>
                    1 &nbsp;&nbsp;&nbsp;本規約は，ユーザーと当方との間の本サービスの利用に関わる一切の関係に適用されるものとします。<br />
                    2 &nbsp;&nbsp;&nbsp;当方は本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。<br />
                    3 &nbsp;&nbsp;&nbsp;本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。
                </p>
                <h2 className="text-2xl font-bold my-5">第2条（利用登録）</h2>
                <p>
                    1 &nbsp;&nbsp;&nbsp;本サービスにおいては，登録希望者が本規約に同意の上，当方の定める方法によって利用登録を申請することによって，利用登録が完了するものとします。<br />
                    2 &nbsp;&nbsp;&nbsp;当方は，利用登録の申請者に，本規約に違反したことがある, または利用登録を相当でないと判断した場合，利用登録を破棄することがあり，その理由については一切の開示義務を負わないものとします。
                </p>
                <h2 className="text-2xl font-bold my-5">第3条（ユーザー名及びパスワードの管理）</h2>
                <p>
                    1 &nbsp;&nbsp;&nbsp;ユーザーは，自己の責任において，本サービスのユーザー名およびパスワードを適切に管理するものとします。<br />
                    2 &nbsp;&nbsp;&nbsp;ユーザーは，いかなる場合にも，ユーザー名およびパスワードを第三者に譲渡または貸与し，もしくは第三者と共用することはできません。当方は，ユーザー名とパスワードの組み合わせが登録情報と一致してログインされた場合には，そのユーザー名を登録しているユーザー自身による利用とみなします。<br />
                    3 &nbsp;&nbsp;&nbsp;ユーザー名及びパスワードが第三者によって使用されたことによって生じた損害について，当方に故意又は重大な過失がある場合を除き，当方は一切の責任を負わないものとします。
                </p>
                <h2 className="text-2xl font-bold my-5">第4条（禁止事項）</h2>
                <p>
                    ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。<br /><br />

                    (1) &nbsp;法令または公序良俗に違反する行為<br />
                    (2) &nbsp;犯罪行為に関連する行為<br />
                    (3) &nbsp;当方，本サービスの他のユーザー，または第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為<br />
                    (4) &nbsp;当方のサービスの運営を妨害するおそれのある行為<br />
                    (5) &nbsp;他のユーザーに関する個人情報等を収集または蓄積する行為<br />
                    (6) &nbsp;不正アクセスをし，またはこれを試みる行為<br />
                    (7) &nbsp;他のユーザーに成りすます行為<br />
                    (8) &nbsp;当方のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為<br />
                    (9) &nbsp;当方，本サービスの他のユーザーまたは第三者の知的財産権，肖像権，プライバシー，名誉その他の権利または利益を侵害する行為<br />
                    (10) &nbsp;以下の表現を含み，または含むと当方が判断する内容を本サービス上に投稿し，または送信する行為<br />
                    &emsp;&emsp;a &nbsp;過度に暴力的な表現<br />
                    &emsp;&emsp;b &nbsp;露骨な性的表現<br />
                    &emsp;&emsp;c &nbsp;人種，国籍，信条，性別，社会的身分，門地等による差別につながる表現<br />
                    &emsp;&emsp;d &nbsp;自殺，自傷行為，薬物乱用を誘引または助長する表現<br />
                    &emsp;&emsp;e &nbsp;その他反社会的な内容を含み他人に不快感を与える表現<br />
                    (11) &nbsp;以下を目的とし，または目的とすると当方が判断する行為<br />
                    &emsp;&emsp;a &nbsp;営業，宣伝，広告，勧誘，その他営利を目的とする行為（当方の認めたものを除きます。）<br />
                    &emsp;&emsp;b &nbsp;他のユーザーに対する嫌がらせや誹謗中傷を目的とする行為<br />
                    &emsp;&emsp;c &nbsp;当方，本サービスの他のユーザー，または第三者に不利益，損害または不快感を与えることを目的とする行為<br />
                    &emsp;&emsp;d &nbsp;その他本サービスが予定している利用目的と異なる目的で本サービスを利用する行為<br />
                    (12) &nbsp;宗教活動または宗教団体への勧誘行為<br />
                    (13) &nbsp;その他，当方が不適切と判断する行為<br />
                </p>
                <h2 className="text-2xl font-bold my-5">第5条（本サービスの提供の停止等）</h2>
                <p>
                    1 &nbsp;&nbsp;&nbsp;当方は，以下のいずれかの事由があると判断した場合，ユーザーに事前の通知をすることなく本サービスの全てまたは一部の提供を停止または中断することができるものとします。<br />
                    &emsp;&emsp;(1) &nbsp;本サービスにかかるコンピュータシステムの保守点検または更新を行う場合<br />
                    &emsp;&emsp;(2) &nbsp;地震，停電, 火災などの自然災害により，本サービスの提供が困難となった場合<br />
                    &emsp;&emsp;(3) &nbsp;本サービスが利用するデータベースおよびAPI等が，なんらかの影響により停止した場合<br />
                    &emsp;&emsp;(4) &nbsp;その他，当方が本サービスの提供が困難と判断した場合<br />
                    2 &nbsp;&nbsp;&nbsp;当方は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。<br />
                </p>
                <h2 className="text-2xl font-bold my-5">第6条（著作権）</h2>
                <p>
                    1 &nbsp;&nbsp;&nbsp;ユーザーは，自らが著作権等の必要な知的財産権を有する，または必要な権利者の許諾を得た文章に関してのみ，本サービスを利用し，投稿することができるものとします。<br />
                    2 &nbsp;&nbsp;&nbsp;ユーザーが本サービスを利用して投稿した文章の著作権については，既存の権利者に留保されるものとします。ただし，当方は，本サービスを利用して投稿された文章について，本サービスの改良，品質の向上，または不備の是正等ならびに本サービスの周知宣伝等に必要な範囲で利用できるものとし，ユーザーは，この利用に関して，著作者人格権を行使しないものとします。<br />
                    3 &nbsp;&nbsp;&nbsp;前項本文の定めるものを除き，本サービスおよび本サービスに関連する一切の情報についての著作権およびその他の知的財産権はすべて当方または当方にその利用を許諾した権利者に帰属し，ユーザーは無断で複製，譲渡，貸与，翻訳，改変，転載，公衆送信（送信可能化を含みます。），伝送，配布，出版，営業使用等をしてはならないものとします。<br />
                </p>
                <h2 className="text-2xl font-bold my-5">第7条（利用制限および登録破棄）</h2>
                <p>
                    1 &nbsp;&nbsp;&nbsp;当方は，ユーザーが本規約のいずれかの条項に違反した場合または，当方が本サービスの利用を適当でないと判断した場合には，事前の通知なく，投稿データの削除，およびユーザーに対して本サービスの全部もしくは一部の利用を制限，またはユーザーとしての登録を破棄することができるものとします。<br />
                    2 &nbsp;&nbsp;&nbsp;当方は，本条に基づき当方が行った行為によりユーザーに生じた損害について，一切の責任を負いません。<br />
                </p>
                <h2 className="text-2xl font-bold my-5">第8条（退会）</h2>
                <p>ユーザーは，当方の定める退会手続により，本サービスから退会できるものとします。</p>
                <h2 className="text-2xl font-bold my-5">第9条（保証の否認および免責事項）</h2>
                <p>
                    当方は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。<br />
                    当方は，本サービスに起因してユーザーに生じたあらゆる損害について、当方の故意又は重過失による場合を除き，一切の責任を負いません。<br />
                    当方は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切の責任を負いません。<br />
                    本サービスは，日本国内に居住する方を対象として提供されています。日本国外からのアカウント登録はご遠慮ください。また，日本国外から本サービスを利用した場合に生じた損害や法的責任について，当方は一切の責任を負いません。
                </p>
                <h2 className="text-2xl font-bold my-5">第10条（サービス内容の変更）</h2>
                <p>当方は，ユーザーに事前の告知をすることなく、本サービスの内容を変更、追加または廃止することがあり、ユーザーはこれを承諾するものとします。</p>
                <h2 className="text-2xl font-bold my-5">第11条（利用規約の変更）</h2>
                <p className="">当方は、自らが必要と判断した場合、ユーザーに事前の告知をすることなく、本規約の内容を変更できるものとします。変更後の本規約は、本サービス上に提示した時点から効力を生じるものとします。</p>
                <h2 className="text-2xl font-bold my-5">第12条（準拠法および裁判管轄）</h2>
                <p className="pb-20">本規約の解釈および適用にあたっては、日本法を準拠法とします。<br />
                本規約または本サービスに関して紛争が生じた場合には、東京地方裁判所を第一審の専属的合意管轄裁判所とします。
                </p>
                
            </div>
        </div>
    )
}